README.org
* Dotfiles for Manjaro
  This is my dotfiles, mainly for these tools,
  vim, emacs, oh-my-zsh, tmux, percol.
  My system is Manjaro (archlinux).
  If you any question ,please contact me.
  My email: xyzgfu@gmail.com, xyzgfu@outlook.com
* Install dependencies
** Emacs
   If use Archlinux (Manjaro) system, you can install newest emacs by following command,
   #+BEGIN_SRC shell
     yaourt -S emacs-git
   #+END_SRC
** percol
   #+BEGIN_SRC shell
     git clone git://github.com/mooz/percol.git
     cd percol
     sudo python setup.py install
   #+END_SRC
   If you don't have a root permission (or don't wanna install percol with sudo), try next one.
   #+BEGIN_SRC shell
     python setup.py install --prefix=~/.local
     export PATH=~/.local/bin:$PATH
   #+END_SRC
** Oh-my-zsh
   You can refer to official site: [[https://github.com/robbyrussell/oh-my-zsh][Oh-my-zsh]]
   Please also refer to my install script file: dotfiles-manjaro/setup/oh-my-zsh.sh
   My install script is as follow,
   #+BEGIN_SRC shell
     echo "Install oh-my-zsh ..."
     wget --no-check-certificate https://github.com/robbyrussell/oh-my-zsh/raw/master/tools/install.sh -O - | sh
     # replace bash to zsh
     chsh -s /bin/zsh

     # powerline-symbol font need to be installed
     if [ ! -d "/usr/share/fonts/OTF" ]; then
         sudo mkdir -p /usr/share/fonts/OTF
     fi
     wget https://raw.githubusercontent.com/powerline/powerline/develop/font/10-powerline-symbols.conf
     wget https://raw.githubusercontent.com/powerline/powerline/develop/font/PowerlineSymbols.otf
     sudo cp 10-powerline-symbols.conf /usr/share/fonts/OTF/
     sudo mv 10-powerline-symbols.conf /etc/fonts/conf.d/
     sudo mv PowerlineSymbols.otf /usr/share/fonts/OTF/

     # config file: ~/.zshrc
     # you can edit default config file, but you also can link your private config file
     # ln -sf <your .zshrc file> ~/.zshrc
     # Finally, reboot your computer
   #+END_SRC
